<?php

/** 
 * Список игроков:
 * %1$s - Команда
 * %2$d - Фраги
 * %3$d - Смерти
 * %4$s - Время
 * %5$s - Мут
 * %6$s - IP
 * %7$s - SteamId
 * %8$s - Ник
 */
/**
 * Информация о сервере:
 * %1$s - Hostname
 * %2$s - IP
 * %3$s - Port
 * %4$d - Количество игроков
 * %5$d - Макс. количество игроков
 * %6$d - Количество ботов
 * %7$s - Карта
 */
const LANG_SOURCE_CONNECTION = [
    /* 00 */    'Ответ от сервера:',
    /* 01 */    'Команда успешно отправлена',
    /* 02 */    'Сообщение содержит 0 или %d+ символов и не может быть отправлено',
    /* 03 */    'Некоторые символы не поддерживаются в игровом чате: %s и заменены на "%s"',
    /* 04 */    'Сообщение успешно отправлено',
    /* 05 */    'Сообщение не отправлено',
    /* 06 */    'Не удалось получить список игроков: %s',
    /* 07 */    '❌',
    /* 08 */    '👀',
    /* 09 */    '🧕',
    /* 10 */    '👮‍♂',
    /* 11 */    '[%s] <<%d/%d>> (%s) %s- %8$s',
    /* 12 */    'д',
    /* 13 */    'ч',
    /* 14 */    'м',
    /* 15 */    'с',
    /* 16 */    '*🙊* ',
    /* 17 */    '[Команда] <<У/С>> (Время) *Мут* - Ник',
    /* 18 */    '[Команда] <SteamId> (Время) [IP] - Ник',
    /* 19 */    '[%s] <%7$s> (%4$s) [%6$s] - %8$s',
    /* 20 */    '%s
IP: %s:%s
Игроки: %d / %d (боты: %d)
Карта: %s',
    /* 21 */    'На сервере нет игроков',
    /* 22 */    '<команда>',
    /* 23 */    'Отправка команды',
    /* 24 */    '<сообщение>',
    /* 25 */    'Отправка сообщения',
    /* 26 */    'Проверка игроков на сервере',
    /* 27 */    'Список игроков с SteamId и IP',
    /* 28 */    'Информация о сервере',
    /* 29 */    'Список игроков',
    /* 30 */    'ркон',
    /* 31 */    'инфо',
    /* 32 */    'стимид',
    /* 33 */    'Связь чата с игровым сервером',
    /* 34 */    'ск',
    /* 35 */    'Операции со всеми серверами',
    /* 36 */    'Общий онлайн: %d из %d игроков (ботов: %d)',
    /* 37 */    '%s
IP: %s:%s
Игроки: %d / %d (боты: %d)
Карта: %s
Команда: %s',
    /* 38 */    'Отправка сообщений на сервер',
];